msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
/*
 *   Name: SPI.cpp
 *
 *   Copyright (c) Mateusz Semegen and contributors. All rights reserved.
 *   Licensed under the MIT license. See LICENSE file in the project root for details.
 */

#ifdef STM32L4

// this
#include <soc/stm32l4/peripherals/SPI.hpp>

// soc
#include <soc/Interrupt_guard.hpp>
#include <soc/system_timer.hpp>

// cml
#include <cml/bit.hpp>
#include <cml/bit_flag.hpp>
#include <cml/debug/assertion.hpp>
#include <cml/utils/wait_until.hpp>
#include <cml/various.hpp>

// externals
#include <stm32l4xx.h>

// TODO: CML - SPI half-duplex and simplex implementation

namespace {

using namespace cml;
using namespace soc::stm32l4::peripherals;

#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L432xx) || \
    defined(STM32L433xx) || defined(STM32L442xx) || defined(STM32L443xx) || defined(STM32L451xx) || \
    defined(STM32L452xx) || defined(STM32L462xx)

enum class Direction_flag : uint32_t
{
    transmit,
    receive
};

constexpr Direction_flag operator|(Direction_flag a_f1, Direction_flag a_f2)
{
    return static_cast<Direction_flag>(static_cast<uint32_t>(a_f1) | static_cast<uint32_t>(a_f2));
}

constexpr Direction_flag operator&(Direction_flag a_f1, Direction_flag a_f2)
{
    return static_cast<Direction_flag>(static_cast<uint32_t>(a_f1) & static_cast<uint32_t>(a_f2));
}

constexpr Direction_flag operator|=(Direction_flag& a_f1, Direction_flag a_f2)
{
    a_f1 = a_f1 | a_f2;
    return a_f1;
}

struct Controller
{
    SPI_TypeDef* p_registers        = nullptr;
    SPI_master* p_spi_master_handle = nullptr;
    SPI_slave* p_spi_slave_handle   = nullptr;
};

Controller controllers[]
{
    { SPI1, nullptr, nullptr },
#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L433xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
        { SPI2, nullptr, nullptr },
#endif
#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
    {
        SPI3, nullptr, nullptr
    }
#endif
};

SPI_TypeDef* get_spi_ptr(SPI_base::Id a_id)
{
    return controllers[static_cast<uint32_t>(a_id)].p_registers;
}

bool is_SPI_SR_error(SPI_base::Id a_id, Direction_flag a_direction)
{
    return bit::is_any(get_spi_ptr(a_id)->SR,
                       SPI_SR_FRE | (Direction_flag::receive == a_direction ? SPI_SR_OVR : 0) | SPI_SR_MODF |
                           SPI_SR_CRCERR);
}

SPI_base::Bus_flag get_bus_flag_from_SPI_SR(SPI_base::Id a_id)
{
    SPI_base::Bus_flag ret = SPI_base::Bus_flag::ok;
    uint32_t sr            = get_spi_ptr(a_id)->SR;

    if (true == bit_flag::is(sr, SPI_SR_OVR))
    {
        ret |= SPI_base::Bus_flag::overrun;
    }

    if (true == bit_flag::is(sr, SPI_SR_FRE))
    {
        ret |= SPI_base::Bus_flag::frame_error;
    }

    if (true == bit_flag::is(sr, SPI_SR_MODF))
    {
        ret |= SPI_base::Bus_flag::mode_fault;
    }

    if (true == bit_flag::is(sr, SPI_SR_CRCERR))
    {
        ret |= SPI_base::Bus_flag::crc_error;
    }

    return ret;
}

void clear_SPI_SR_overrun(SPI_base::Id a_id)
{
    volatile uint32_t t1 = get_spi_ptr(a_id)->DR;
    volatile uint32_t t2 = get_spi_ptr(a_id)->SR;

    unused(t1);
    unused(t2);
}

void clear_SPI_SR_errors(SPI_base::Id a_id)
{
    const uint32_t sr = get_spi_ptr(a_id)->SR;

    if (true == bit_flag::is(sr, SPI_SR_OVR))
    {
        volatile uint32_t t1 = get_spi_ptr(a_id)->DR;
        volatile uint32_t t2 = get_spi_ptr(a_id)->SR;

        unused(t1);
        unused(t2);
    }

    if (true == bit_flag::is(sr, SPI_SR_MODF))
    {
        volatile uint32_t t1 = get_spi_ptr(a_id)->SR;
        unused(t1);

        bit_flag::set(&(get_spi_ptr(a_id)->CR1), SPI_CR1_SPE);
    }

    if (true == bit_flag::is(sr, SPI_SR_FRE))
    {
        volatile uint32_t t1 = get_spi_ptr(a_id)->SR;
        unused(t1);
    }

    if (true == bit_flag::is(sr, SPI_SR_CRCERR))
    {
        bit::clear(&(get_spi_ptr(a_id)->SR), SPI_SR_CRCERR_Pos);
    }
}

#endif

} // namespace

extern "C" {

#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L432xx) || \
    defined(STM32L433xx) || defined(STM32L442xx) || defined(STM32L443xx) || defined(STM32L451xx) || \
    defined(STM32L452xx) || defined(STM32L462xx)

void interupt_handler(uint32_t a_controller_index)
{
    cml_assert(nullptr != controllers[a_controller_index].p_spi_master_handle ||
               nullptr != controllers[a_controller_index].p_spi_slave_handle);

    if (nullptr != controllers[a_controller_index].p_spi_master_handle)
    {
        spi_interrupt_handler(controllers[a_controller_index].p_spi_master_handle);
    }
    else if (nullptr != controllers[a_controller_index].p_spi_slave_handle)
    {
        spi_interrupt_handler(controllers[a_controller_index].p_spi_slave_handle);
    }
}

void SPI1_IRQHandler()
{
    interupt_handler(0);
}

void SPI2_IRQHandler()
{
    interupt_handler(1);
}

void SPI3_IRQHandler()
{
    interupt_handler(2);
}

#endif

} // extern "C"

namespace soc {
namespace stm32l4 {
namespace peripherals {

using namespace cml;
using namespace cml::utils;

#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L432xx) || \
    defined(STM32L433xx) || defined(STM32L442xx) || defined(STM32L443xx) || defined(STM32L451xx) || \
    defined(STM32L452xx) || defined(STM32L462xx)

void spi_interrupt_handler(SPI_base* a_p_this)
{
    const uint32_t sr  = get_spi_ptr(a_p_this->id)->SR;
    const uint32_t cr2 = get_spi_ptr(a_p_this->id)->CR2;

    if (true == bit::is_any(sr, SPI_SR_FRE | SPI_SR_OVR | SPI_SR_MODF | SPI_SR_CRCERR))
    {
        if (nullptr != a_p_this->bus_status_callback.function)
        {
            a_p_this->bus_status_callback.function(
                get_bus_flag_from_SPI_SR(a_p_this->id), a_p_this, a_p_this->transmit_callback.p_user_data);
        }

        clear_SPI_SR_errors(a_p_this->id);
    }

    if (nullptr != a_p_this->transmit_callback.function || nullptr != a_p_this->transmit_receive_callback.transmit)
    {
        if (true == bit_flag::is(sr, SPI_SR_TXE) && true == bit_flag::is(cr2, SPI_CR2_TXEIE))
        {
            if (nullptr != a_p_this->transmit_callback.function)
            {
                if (static_cast<SPI_master::Frame_format::Word_length>(bit_flag::get(cr2, SPI_CR2_DS)) >
                    SPI_master::Frame_format::Word_length::_8)
                {
                    a_p_this->transmit_callback.function(
                        reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(a_p_this->id)->DR)),
                        false,
                        a_p_this,
                        a_p_this->transmit_callback.p_user_data);
                }
                else
                {
                    a_p_this->transmit_callback.function(
                        reinterpret_cast<volatile uint16_t*>(
                            reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(a_p_this->id)->DR))),
                        false,
                        a_p_this,
                        a_p_this->transmit_callback.p_user_data);
                }
            }

            if (nullptr != a_p_this->transmit_receive_callback.transmit)
            {
                if (static_cast<SPI_master::Frame_format::Word_length>(bit_flag::get(cr2, SPI_CR2_DS)) >
                    SPI_master::Frame_format::Word_length::_8)
                {
                    a_p_this->transmit_receive_callback.transmit(
                        reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(a_p_this->id)->DR)),
                        false,
                        a_p_this,
                        a_p_this->transmit_receive_callback.p_user_data);
                }
                else
                {
                    a_p_this->transmit_receive_callback.transmit(
                        reinterpret_cast<volatile uint16_t*>(
                            reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(a_p_this->id)->DR))),
                        false,
                        a_p_this,
                        a_p_this->transmit_receive_callback.p_user_data);
                }
            }

            if (false == bit_flag::is(get_spi_ptr(a_p_this->id)->SR, SPI_SR_BSY))
            {
                if (nullptr != a_p_this->transmit_callback.function)
                {
                    a_p_this->transmit_callback.function(
                        nullptr, true, a_p_this, a_p_this->transmit_callback.p_user_data);
                }

                if (nullptr != a_p_this->transmit_receive_callback.transmit)
                {
                    a_p_this->transmit_receive_callback.transmit(
                        nullptr, true, a_p_this, a_p_this->transmit_receive_callback.p_user_data);
                }
            }
        }
    }

    if (nullptr != a_p_this->receive_callback.function || nullptr != a_p_this->transmit_receive_callback.receive)
    {
        if (true == bit_flag::is(sr, SPI_SR_RXNE) && true == bit_flag::is(cr2, SPI_CR2_RXNEIE))
        {
            if (nullptr != a_p_this->receive_callback.function)
            {
                if (static_cast<SPI_master::Frame_format::Word_length>(bit_flag::get(cr2, SPI_CR2_DS)) >
                    SPI_master::Frame_format::Word_length::_8)
                {
                    a_p_this->receive_callback.function(
                        (*reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(a_p_this->id)->DR))),
                        a_p_this,
                        a_p_this->receive_callback.p_user_data);
                }
                else
                {
                    a_p_this->receive_callback.function(
                        (*reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(a_p_this->id)->DR))),
                        a_p_this,
                        a_p_this->receive_callback.p_user_data);
                }
            }

            if (nullptr != a_p_this->transmit_receive_callback.receive)
            {
                if (static_cast<SPI_master::Frame_format::Word_length>(bit_flag::get(cr2, SPI_CR2_DS)) >
                    SPI_master::Frame_format::Word_length::_8)
                {
                    a_p_this->transmit_receive_callback.receive(
                        (*reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(a_p_this->id)->DR))),
                        a_p_this,
                        a_p_this->transmit_receive_callback.p_user_data);
                }
                else
                {
                    a_p_this->transmit_receive_callback.receive(
                        (*reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(a_p_this->id)->DR))),
                        a_p_this,
                        a_p_this->transmit_receive_callback.p_user_data);
                }
            }
        }
    }
}

void SPI_base::register_transmit_callback(const Transmit_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->transmit_callback = a_callback;

    bit_flag::set(&(get_spi_ptr(this->id)->CR2), SPI_CR2_TXEIE);
}

void SPI_base::register_receive_callback(const Receive_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

