msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
    this->receive_callback = a_callback;

    bit_flag::set(&(get_spi_ptr(this->id)->CR2), SPI_CR2_RXNEIE);
}

void SPI_base::register_transmit_receive_callaback(const Transmit_receive_callback& a_callback)
{
    cml_assert(nullptr != a_callback.transmit);
    cml_assert(nullptr != a_callback.receive);

    Interrupt_guard guard;

    this->transmit_receive_callback = a_callback;

    bit_flag::set(&(get_spi_ptr(this->id)->CR2), SPI_CR2_RXNEIE | SPI_CR2_TXEIE);
}

void SPI_base::register_bus_status_callback(const Bus_status_callback& a_callback)
{
    cml_assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->bus_status_callback = a_callback;

    bit_flag::set(&(get_spi_ptr(this->id)->CR2), SPI_CR2_ERRIE);
}

void SPI_base::unregister_transmit_callback()
{
    cml_assert(nullptr != this->transmit_callback.function);

    Interrupt_guard guard;

    bit_flag::clear(&(get_spi_ptr(this->id)->CR2), SPI_CR2_TXEIE);

    this->bus_status_callback = { nullptr, nullptr };
}

void SPI_base::unregister_receive_callback()
{
    cml_assert(nullptr != this->receive_callback.function);

    Interrupt_guard guard;

    bit_flag::clear(&(get_spi_ptr(this->id)->CR2), SPI_CR2_RXNEIE);

    this->receive_callback = { nullptr, nullptr };
}

void SPI_base::unregister_transmit_receive_callback()
{
    cml_assert(nullptr != this->transmit_receive_callback.receive &&
               nullptr != this->transmit_receive_callback.transmit);

    Interrupt_guard guard;

    bit_flag::clear(&(get_spi_ptr(this->id)->CR2), SPI_CR2_RXNEIE | SPI_CR2_TXEIE);

    this->transmit_receive_callback = { nullptr, nullptr, nullptr };
}

void SPI_base::unregister_bus_status_callback()
{
    cml_assert(nullptr != this->bus_status_callback.function);

    Interrupt_guard guard;

    bit_flag::clear(&(get_spi_ptr(this->id)->CR2), SPI_CR2_ERRIE);

    this->bus_status_callback = { nullptr, nullptr };
}

SPI_base::Frame_format SPI_base::get_frame_format() const
{
    return { true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_CPOL) ? Frame_format::Polarity::high :
                                                                              Frame_format::Polarity::low,
             true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_CPHA) ? Frame_format::Phase::second_edge :
                                                                              Frame_format::Phase::first_edge,
             static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)),
             true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_LSBFIRST) ?
                 Frame_format::Bit_significance::least :
                 Frame_format::Bit_significance::most };
}

void SPI_master::enable(const Config& a_config, const Frame_format& a_frame_format, uint32_t a_irq_priority)
{
    cml_assert(static_cast<Config::Wiring>(static_cast<uint32_t>(Config::Wiring::half_duplex) + 1) != a_config.wiring);
    cml_assert(static_cast<Config::Crc>(static_cast<uint32_t>(Config::Crc::enable) + 1) != a_config.crc);
    cml_assert(static_cast<Config::NSS_management>(static_cast<uint32_t>(Config::NSS_management::software) + 1) !=
               a_config.nss_management);
    cml_assert(
        static_cast<Frame_format::Bit_significance>(static_cast<uint32_t>(Frame_format::Bit_significance::least) + 1) !=
        a_frame_format.bit_significance);
    cml_assert(static_cast<Frame_format::Phase>(static_cast<uint32_t>(Frame_format::Phase::second_edge) + 1) !=
               a_frame_format.phase);
    cml_assert(static_cast<Frame_format::Polarity>(static_cast<uint32_t>(Frame_format::Polarity::high) + 1) !=
               a_frame_format.polarity);
    cml_assert(static_cast<Frame_format::Word_length>(static_cast<uint32_t>(Frame_format::Word_length::_16) + 1) !=
               a_frame_format.word_length);
    cml_assert(static_cast<Config::Clock_prescaler>(static_cast<uint32_t>(Config::Clock_prescaler::_256) + 1) !=
               a_config.clock_prescaler);

    // not implemented Config::Wiring::half_duplex and Config::Wiring::Simplex
    cml_assert(Config::Wiring::full_duplex == a_config.wiring);

    cml_assert(nullptr == controllers[static_cast<uint32_t>(this->id)].p_spi_slave_handle &&
               nullptr == controllers[static_cast<uint32_t>(this->id)].p_spi_master_handle);

    controllers[static_cast<uint32_t>(this->id)].p_spi_slave_handle  = nullptr;
    controllers[static_cast<uint32_t>(this->id)].p_spi_master_handle = this;

    get_spi_ptr(this->id)->CR2 = static_cast<uint32_t>(a_frame_format.word_length) | SPI_CR2_SSOE |
                                 (a_frame_format.word_length <= Frame_format::Word_length::_8 ? SPI_CR2_FRXTH : 0x0u) |
                                 (Config::NSS_management::hardware == a_config.nss_management ? SPI_CR2_SSOE : 0x0u);

    get_spi_ptr(this->id)->CR1 =
        SPI_CR1_MSTR | static_cast<uint32_t>(a_config.wiring) | static_cast<uint32_t>(a_frame_format.phase) |
        static_cast<uint32_t>(a_frame_format.polarity) | static_cast<uint32_t>(a_frame_format.bit_significance) |
        static_cast<uint32_t>(a_config.clock_prescaler) | (Config::Crc::enable == a_config.crc ? SPI_CR1_CRCEN : 0x0u) |
        (Config::NSS_management::software == a_config.nss_management ? SPI_CR1_SSM | SPI_CR1_SSI | SPI_CR1_SPE : 0x0u);

    switch (this->id)
    {
        case Id::_1: {
            NVIC_SetPriority(IRQn_Type::SPI1_IRQn, a_irq_priority);
            NVIC_EnableIRQ(IRQn_Type::SPI1_IRQn);
        }
        break;
#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L433xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
        case Id::_2: {
            NVIC_SetPriority(IRQn_Type::SPI2_IRQn, a_irq_priority);
            NVIC_EnableIRQ(IRQn_Type::SPI2_IRQn);
        }
#endif
#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
        case Id::_3: {
            NVIC_SetPriority(IRQn_Type::SPI3_IRQn, a_irq_priority);
            NVIC_EnableIRQ(IRQn_Type::SPI3_IRQn);
        }
        break;
#endif
    }
}

void SPI_master::disable()
{
    switch (this->id)
    {
        case Id::_1: {
            NVIC_DisableIRQ(IRQn_Type::SPI1_IRQn);
        }
        break;
#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L433xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
        case Id::_2: {
            NVIC_DisableIRQ(IRQn_Type::SPI2_IRQn);
        }
#endif
#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
        case Id::_3: {
            NVIC_DisableIRQ(IRQn_Type::SPI3_IRQn);
        }
        break;
#endif
    }

    if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_BIDIMODE) &&
        true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_RXONLY))
    {
        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
        wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);

        while (true == bit::is_any(get_spi_ptr(this->id)->SR, SPI_SR_FRLVL))
        {
            volatile uint32_t dr = get_spi_ptr(this->id)->DR;
            unused(dr);
        }
    }
    else
    {
        wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);
        wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);

        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);

        while (true == bit::is_any(get_spi_ptr(this->id)->SR, SPI_SR_FRLVL))
        {
            volatile uint32_t dr = get_spi_ptr(this->id)->DR;
            unused(dr);
        }
    }

