msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
    get_spi_ptr(this->id)->CR2 = 0;
    get_spi_ptr(this->id)->CR1 = 0;

    controllers[static_cast<uint32_t>(this->id)].p_spi_master_handle = nullptr;
}

SPI_master::Result
SPI_master::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_words, GPIO::Out::Pin* a_p_nss)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::low);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::set(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    bool error        = false;
    bool busy         = true;
    uint32_t words    = 0;
    Bus_flag bus_flag = Bus_flag::ok;

    while (true == busy && false == error)
    {
        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) && words < a_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_data)[words++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_data)[words++];
            }
        }

        error = is_SPI_SR_error(this->id, Direction_flag::transmit);
        busy  = bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_BSY);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);

    clear_SPI_SR_overrun(this->id);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::high);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    return { bus_flag, words };
}

SPI_master::Result SPI_master::transmit_bytes_polling(const void* a_p_data,
                                                      uint32_t a_data_size_in_words,
                                                      uint32_t a_timeout,
                                                      GPIO::Out::Pin* a_p_nss)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    uint32_t start = system_timer::get();

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::low);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::set(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    bool error        = false;
    bool busy         = true;
    uint32_t words    = 0;
    Bus_flag bus_flag = Bus_flag::ok;

    while (true == busy && false == error && a_timeout >= various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) && words < a_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_data)[words++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_data)[words++];
            }
        }

        error = is_SPI_SR_error(this->id, Direction_flag::transmit);
        busy  = bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_BSY);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);

    clear_SPI_SR_overrun(this->id);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::high);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    return { bus_flag, words };
}

SPI_master::Result
SPI_master::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words, GPIO::Out::Pin* a_p_nss)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::low);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::set(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    bool error           = false;
    bool transmit_enable = true;
    uint32_t words       = 0;
    Bus_flag bus_flag    = Bus_flag::ok;

    while (false == error && words < a_data_size_in_words)
    {
        if (true == transmit_enable && true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) = static_cast<uint16_t>(0xFFFFu);
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) = static_cast<uint8_t>(0xFFu);
            }

