msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
            transmit_enable = false;
        }

        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_RXNE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                static_cast<uint16_t*>(a_p_data)[words++] = static_cast<uint16_t>(get_spi_ptr(this->id)->DR);
            }
            else
            {
                static_cast<uint8_t*>(a_p_data)[words++] = static_cast<uint8_t>(get_spi_ptr(this->id)->DR);
            }

            transmit_enable = true;
        }

        error = is_SPI_SR_error(this->id, Direction_flag::receive);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);
    wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);
    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::high);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    return { bus_flag, words };
}

SPI_master::Result SPI_master::receive_bytes_polling(void* a_p_data,
                                                     uint32_t a_data_size_in_words,
                                                     uint32_t a_timeout,
                                                     GPIO::Out::Pin* a_p_nss)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    uint32_t start = system_timer::get();

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::low);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::set(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    bool error           = false;
    bool transmit_enable = true;
    uint32_t words       = 0;
    Bus_flag bus_flag    = Bus_flag::ok;

    while (false == error && words < a_data_size_in_words &&
           a_timeout >= various::time_diff(system_timer::get(), start))
    {
        if (true == transmit_enable && true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) = static_cast<uint16_t>(0xFFFFu);
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) = static_cast<uint8_t>(0xFFu);
            }

            transmit_enable = false;
        }

        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_RXNE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                static_cast<uint16_t*>(a_p_data)[words++] = static_cast<uint16_t>(get_spi_ptr(this->id)->DR);
            }
            else
            {
                static_cast<uint8_t*>(a_p_data)[words++] = static_cast<uint8_t>(get_spi_ptr(this->id)->DR);
            }

            transmit_enable = true;
        }

        error = is_SPI_SR_error(this->id, Direction_flag::receive);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);
    wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);
    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::high);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    return { bus_flag, words };
}

SPI_master::Result SPI_master::transmit_receive_bytes_polling(const void* a_p_tx_data,
                                                              void* a_p_rx_data,
                                                              uint32_t a_tx_rx_data_size_in_words,
                                                              GPIO::Out::Pin* a_p_nss)
{
    cml_assert(nullptr != a_p_tx_data);
    cml_assert(nullptr != a_p_rx_data);
    cml_assert(a_tx_rx_data_size_in_words > 0);

    if (nullptr != a_p_nss && true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        a_p_nss->set_level(GPIO::Level::low);
    }
    else if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_SSM))
    {
        bit_flag::set(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
    }

    bool error           = false;
    bool transmit_enable = true;
    Bus_flag bus_flag    = Bus_flag::ok;

    uint32_t tx_idx = 0;
    uint32_t rx_idx = 0;

    while (false == error && rx_idx < a_tx_rx_data_size_in_words)
    {
        if (true == transmit_enable && true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) &&
            tx_idx < a_tx_rx_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_tx_data)[tx_idx++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_tx_data)[tx_idx++];
            }

