msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
    // not implemented Config::Wiring::half_duplex and Config::Wiring::Simplex
    cml_assert(Config::Wiring::full_duplex == a_config.wiring);

    cml_assert(nullptr == controllers[static_cast<uint32_t>(this->id)].p_spi_slave_handle &&
               nullptr == controllers[static_cast<uint32_t>(this->id)].p_spi_master_handle);

    controllers[static_cast<uint32_t>(this->id)].p_spi_slave_handle  = this;
    controllers[static_cast<uint32_t>(this->id)].p_spi_master_handle = nullptr;

    get_spi_ptr(this->id)->CR2 = static_cast<uint32_t>(a_frame_format.word_length) | SPI_CR2_SSOE |
                                 (a_frame_format.word_length <= Frame_format::Word_length::_8 ? SPI_CR2_FRXTH : 0x0u);

    get_spi_ptr(this->id)->CR1 = static_cast<uint32_t>(a_config.wiring) | static_cast<uint32_t>(a_frame_format.phase) |
                                 static_cast<uint32_t>(a_frame_format.polarity) |
                                 static_cast<uint32_t>(a_frame_format.bit_significance) |
                                 static_cast<uint32_t>(a_config.clock_prescaler) |
                                 (Config::Crc::enable == a_config.crc ? SPI_CR1_CRCEN : 0x0u) | SPI_CR1_SPE;
}

void SPI_slave::disable()
{
    if (false == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_BIDIMODE) &&
        true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_RXONLY))
    {
        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);
        wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);

        while (true == bit::is_any(get_spi_ptr(this->id)->SR, SPI_SR_FRLVL))
        {
            volatile uint32_t dr = get_spi_ptr(this->id)->DR;
            unused(dr);
        }
    }
    else
    {
        wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);
        wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);

        bit_flag::clear(&(get_spi_ptr(this->id)->CR1), SPI_CR1_SPE);

        while (true == bit::is_any(get_spi_ptr(this->id)->SR, SPI_SR_FRLVL))
        {
            volatile uint32_t dr = get_spi_ptr(this->id)->DR;
            unused(dr);
        }
    }

    get_spi_ptr(this->id)->CR2 = 0;
    get_spi_ptr(this->id)->CR1 = 0;

    controllers[static_cast<uint32_t>(this->id)].p_spi_master_handle = nullptr;
}

SPI_slave::Result SPI_slave::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_words)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    bool error        = false;
    bool busy         = true;
    uint32_t words    = 0;
    Bus_flag bus_flag = Bus_flag::ok;

    while (true == busy && false == error)
    {
        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) && words < a_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_data)[words++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_data)[words++];
            }
        }

        error = is_SPI_SR_error(this->id, Direction_flag::transmit);
        busy  = bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_BSY);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);

    clear_SPI_SR_overrun(this->id);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    return { bus_flag, words };
}

SPI_slave::Result
SPI_slave::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_words, uint32_t a_timeout)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    uint32_t start = system_timer::get();

    bool error        = false;
    bool busy         = true;
    uint32_t words    = 0;
    Bus_flag bus_flag = Bus_flag::ok;

    while (true == busy && false == error && a_timeout >= various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) && words < a_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_data)[words++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_data)[words++];
            }
        }

        error = is_SPI_SR_error(this->id, Direction_flag::transmit);
        busy  = bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_BSY);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);

    clear_SPI_SR_overrun(this->id);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    return { bus_flag, words };
}

SPI_slave::Result SPI_slave::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    bool error        = false;
    uint32_t words    = 0;
    Bus_flag bus_flag = Bus_flag::ok;

    while (false == error && words < a_data_size_in_words)
    {
        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_RXNE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                static_cast<uint16_t*>(a_p_data)[words++] = static_cast<uint16_t>(get_spi_ptr(this->id)->DR);
            }
            else
            {
                static_cast<uint8_t*>(a_p_data)[words++] = static_cast<uint8_t>(get_spi_ptr(this->id)->DR);
            }
        }

        error = is_SPI_SR_error(this->id, Direction_flag::receive);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);
    wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);
    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);

