msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    return { bus_flag, words };
}

SPI_slave::Result SPI_slave::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_words, uint32_t a_timeout)
{
    cml_assert(nullptr != a_p_data);
    cml_assert(a_data_size_in_words > 0);

    uint32_t start = system_timer::get();

    bool error        = false;
    uint32_t words    = 0;
    Bus_flag bus_flag = Bus_flag::ok;

    while (false == error && words < a_data_size_in_words &&
           a_timeout >= various::time_diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_RXNE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                static_cast<uint16_t*>(a_p_data)[words++] = static_cast<uint16_t>(get_spi_ptr(this->id)->DR);
            }
            else
            {
                static_cast<uint8_t*>(a_p_data)[words++] = static_cast<uint8_t>(get_spi_ptr(this->id)->DR);
            }
        }

        error = is_SPI_SR_error(this->id, Direction_flag::receive);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);
    wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);
    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    return { bus_flag, words };
}

SPI_slave::Result SPI_slave::transmit_receive_bytes_polling(const void* a_p_tx_data,
                                                            void* a_p_rx_data,
                                                            uint32_t a_tx_rx_data_size_in_words)
{
    cml_assert(nullptr != a_p_tx_data);
    cml_assert(nullptr != a_p_rx_data);
    cml_assert(a_tx_rx_data_size_in_words > 0);

    bool error           = false;
    bool transmit_enable = true;
    Bus_flag bus_flag    = Bus_flag::ok;

    uint32_t tx_idx = 0;
    uint32_t rx_idx = 0;

    while (false == error && rx_idx < a_tx_rx_data_size_in_words)
    {
        if (true == transmit_enable && true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) &&
            tx_idx < a_tx_rx_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_tx_data)[tx_idx++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_tx_data)[tx_idx++];
            }

            transmit_enable = false;
        }

        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_RXNE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                uint16_t t = static_cast<uint16_t>(get_spi_ptr(this->id)->DR);

                if (rx_idx < a_tx_rx_data_size_in_words)
                {
                    static_cast<uint16_t*>(a_p_rx_data)[rx_idx++] = t;
                }
            }
            else
            {
                uint8_t t = static_cast<uint8_t>(get_spi_ptr(this->id)->DR);

                if (rx_idx < a_tx_rx_data_size_in_words)
                {
                    static_cast<uint8_t*>(a_p_rx_data)[rx_idx++] = t;
                }
            }

            transmit_enable = true;
        }

        error = is_SPI_SR_error(this->id, Direction_flag::transmit | Direction_flag::receive);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);
    wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);
    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    return { bus_flag, rx_idx };
}

SPI_slave::Result SPI_slave::transmit_receive_bytes_polling(const void* a_p_tx_data,
                                                            void* a_p_rx_data,
                                                            uint32_t a_tx_rx_data_size_in_words,
                                                            uint32_t a_timeout)
{
    cml_assert(nullptr != a_p_tx_data);
    cml_assert(nullptr != a_p_rx_data);
    cml_assert(a_tx_rx_data_size_in_words > 0);

    uint32_t start = system_timer::get();

    bool error           = false;
    bool transmit_enable = true;
    Bus_flag bus_flag    = Bus_flag::ok;

    uint32_t tx_idx = 0;
    uint32_t rx_idx = 0;

    while (false == error && rx_idx < a_tx_rx_data_size_in_words &&
           a_timeout >= various::time_diff(system_timer::get(), start))
    {
        if (true == transmit_enable && true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_TXE) &&
            tx_idx < a_tx_rx_data_size_in_words)
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                *(reinterpret_cast<volatile uint16_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint16_t*>(a_p_tx_data)[tx_idx++];
            }
            else
            {
                *(reinterpret_cast<volatile uint8_t*>(&(get_spi_ptr(this->id)->DR))) =
                    static_cast<const uint8_t*>(a_p_tx_data)[tx_idx++];
            }

