msemegen/CML/lib/soc/stm32l4/peripherals/SPI.cpp
            transmit_enable = false;
        }

        if (true == bit_flag::is(get_spi_ptr(this->id)->SR, SPI_SR_RXNE))
        {
            if (static_cast<Frame_format::Word_length>(bit_flag::get(get_spi_ptr(this->id)->CR2, SPI_CR2_DS)) >
                Frame_format::Word_length::_8)
            {
                uint16_t t = static_cast<uint16_t>(get_spi_ptr(this->id)->DR);

                if (rx_idx < a_tx_rx_data_size_in_words)
                {
                    static_cast<uint16_t*>(a_p_rx_data)[rx_idx++] = t;
                }
            }
            else
            {
                uint8_t t = static_cast<uint8_t>(get_spi_ptr(this->id)->DR);

                if (rx_idx < a_tx_rx_data_size_in_words)
                {
                    static_cast<uint8_t*>(a_p_rx_data)[rx_idx++] = t;
                }
            }

            transmit_enable = true;
        }

        error = is_SPI_SR_error(this->id, Direction_flag::transmit | Direction_flag::receive);
    }

    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FTLVL, true);
    wait_until::all_bits(&(get_spi_ptr(this->id)->SR), SPI_SR_BSY, true);
    wait_until::any_bit(&(get_spi_ptr(this->id)->SR), SPI_SR_FRLVL, true);

    if (true == error)
    {
        bus_flag = get_bus_flag_from_SPI_SR(this->id);

        if (Bus_flag::ok != bus_flag)
        {
            clear_SPI_SR_errors(this->id);
        }
    }

    return { bus_flag, rx_idx };
}

SPI_slave::Config SPI_slave::get_config() const
{
    return { static_cast<Config::Clock_prescaler>(bit_flag::get(get_spi_ptr(this->id)->CR1, SPI_CR1_BR_Msk)),
             true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_BIDIMODE) ?
                 Config::Wiring::half_duplex :
                 (true == bit_flag::is(get_spi_ptr(this->id)->CR1, SPI_CR1_RXONLY) ? Config::Wiring::simplex :
                                                                                     Config::Wiring::full_duplex),
             static_cast<Config::Crc>(bit_flag::get(get_spi_ptr(this->id)->CR1, SPI_CR1_CRCEN)) };
}

#endif

} // namespace peripherals
} // namespace stm32l4
} // namespace soc

namespace soc {
namespace stm32l4 {

using namespace soc::stm32l4::peripherals;

void rcc<SPI_base>::enable(SPI_base::Id a_id, bool a_enable_in_lp)
{
    if (SPI_base::Id::_1 == a_id)
    {
        bit::set(&(RCC->APB2ENR), RCC_APB2ENR_SPI1EN_Pos);
    }
    else
    {
        bit::set(&(RCC->APB1ENR1), RCC_APB1ENR1_SPI2EN_Pos + (static_cast<uint32_t>(a_id) - 1));
    }

    if (true == a_enable_in_lp)
    {
        if (SPI_base::Id::_1 == a_id)
        {
            bit::set(&(RCC->APB2SMENR), RCC_APB2SMENR_SPI1SMEN_Pos);
        }
        else
        {
            bit::set(&(RCC->APB1SMENR1), RCC_APB1SMENR1_SPI3SMEN_Pos + (static_cast<uint32_t>(a_id) - 1));
        }
    }
}
void rcc<SPI_base>::disable(SPI_base::Id a_id)
{
    if (SPI_base::Id::_1 == a_id)
    {
        bit::clear(&(RCC->APB2ENR), RCC_APB2ENR_SPI1EN_Pos);
        bit::clear(&(RCC->APB2SMENR), RCC_APB2SMENR_SPI1SMEN_Pos);
    }
    else
    {
        bit::clear(&(RCC->APB1ENR1), RCC_APB1ENR1_SPI2EN_Pos + (static_cast<uint32_t>(a_id) - 1));
        bit::clear(&(RCC->APB1SMENR1), RCC_APB1SMENR1_SPI3SMEN_Pos + (static_cast<uint32_t>(a_id) - 1));
    }
}

} // namespace stm32l4
} // namespace soc

#endif // STM32L4